
[Abduction X2AbilityTemplate]
LocFriendlyName="绑架"
LocFlyOverText="绑架"
LocHelpText="绑架一个晕眩或混乱的目标。"
LocLongDescription="灰人绑架者会试图绑架其活动范围内的任何晕眩了或者以任何方式变得晕眩了的目标。如果没有眩晕目标可用，它将尝试绑架一个混乱的目标。"

[AbductionMove X2AbilityTemplate]
LocFriendlyName="绑架"
LocFlyOverText="绑架"
LocHelpText="绑架一个晕眩或混乱的目标。"
LocLongDescription="灰人绑架者会试图绑架其活动范围内的任何晕眩了或者以任何方式变得晕眩了的目标。如果没有眩晕目标可用，它将尝试绑架一个混乱的目标。"


[AbductorStunShot X2AbilityTemplate]
LocFriendlyName="眩晕打击"
LocFlyOverText="眩晕打击"
LocHelpText="一个特殊的射击，可以从灰人绑架者的手腕武器发出，会造成眩晕。"
LocLongDescription="这个能力可以使那些被击中的人晕眩。"


[SectoidAbductor X2CharacterTemplate]
strCharacterName="灰人绑架者"

[SectoidAbductorM2 X2CharacterTemplate]
strCharacterName="灰人绑架者"

[SectoidAbductor_WPN X2WeaponTemplate]
FriendlyName="绑架者光束手枪"

[SectoidAbductorM2_WPN X2WeaponTemplate]
FriendlyName="绑架者光束手枪"

[SectoidAbduction X2SitRepTemplate]
FriendlyName="灰人绑架"
Description="外星人在该地区绑架平民和反抗军。"

[SectoidAbductionEffect X2SitRepEffect_ModifyDefaultEncounterLists]
FriendlyName="灰人绑架"
Description="看来外星人派出了一支庞大的派系和先遣支援部队，在该地区绑架了尽可能多的平民和/或反抗军目标。他们可能已经绑架了他们的目标。高度警惕，指挥官。"


[SecureUFOAbductors X2MissionTemplate]
DisplayName="捕获着陆的灰人UFO"
Briefing="抵抗组织报告说灰人UFO正在此地区补充变种人部队。捕获不明飞行物，拿取所有的物资."
PostMissionType="捕获着陆的灰人UFO"
BriefingImage="img:///UILibrary_Common.Xcom_default"
ObjectiveTextPools[0]="消灭所有敌人目标"
ObjectiveTextPools[1]="捕获UFO以获得补给"
PreMissionNarratives[0]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_01"
PreMissionNarratives[1]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_02"
PreMissionNarratives[2]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_03"
PreMissionNarratives[3]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_04"
PreMissionNarratives[4]="X2NarrativeMoments.TACTICAL.SecureUFO.T_Secure_UFO_Narrative_Wrappers_05"

[SecureUFOAbductors X2MissionNarrativeTemplate]
ObjectiveTextPools[0]="消灭所有守卫UFO的敌人"
ObjectiveTextPools[1]="关闭敌方求援信标"
ObjectiveTextPools[2]="解救所有XCOM战士"